[
    {
        "title": "1994 Land Rover Defender 110",
        "city": "Ticonderoga, NY",
        "zip": "12883",
        "description": "138,000 MILES\n\nSPORT UTILITY 2D\n\nORANGE\n\nTUBO DIESEL\n\nSOFT TOP\n\nREAR BENCH SEATING",
        "price": "$95,000"
    },
    {
        "title": "SUV for sale",
        "city": "St Joseph",
        "zip": "64507",
        "description": "Ford explorer 2023 model available for sale In Good health brand new Dm for more information",
        "price": "$37000"
    },
    {
        "title": "New 2024 Honda HR-V EX-L w/BSI SUV",
        "city": "Fargo, ND",
        "zip": "58103",
        "description": "Platinum White Pearl 2024 Honda HR-V EX-L AWD\n\n\n\n*Adaptive Cruise Control, Heated Seats, Blind-Spot Monitors, Lane Keeping Assist, Backup Camera, Keyless Access with Push Button Start, Automatic Headlights, Voice Recognition, Bluetooth, Sunroof/Moonroof, 4x4/ 4 Wheel Drive / AWD, Wireless Apple CarPlay, Wireless Android Auto, Wireless Phone Charger, Parking Sensors, Remote Start, Automatic temperature control, Emergency communication system: HondaLink, Front dual zone A/C, Power driver seat, Radio: 180-Watt Audio System w/8 Speakers, Remote keyless entry, SiriusXM, Steering wheel mounted audio controls, Telescoping steering wheel.",
        "price": "$31,480"
    },
    {
        "title": "2012 Dodge Durango AWD RT-EDITION",
        "city": "Omaha, NE",
        "zip": "68104",
        "description": "Clean title in my hand. Car runs and drives excellent! NO TRADES/NO PAYMENTS/ONLY CASH IN HAND!",
        "price": "$3990"
    },
    {
        "title": "2022 RANGER ROVER SPORTS, FOR SALE AT A LOW COST",
        "city": "New York, NY",
        "zip": "10001",
        "description": "The 2022 Range Rover Sport comes with a turbocharged 3.0-liter inline-six-cylinder, Land Rover's excellent all-wheel-drive system, and an exceptional eight-speed automatic transmission. The engine is assisted by a 48-volt hybrid system and makes 355 horsepower.Inside, the 2022 Range Rover Sport has almost the same dimensions as the full-size Range Rover model. Both SUVs share the same 115-inch wheelbase, which gives the Range Rover Sport more rear-seat space than you'll find in many of its competitors. Unlike the Range Rover, the Range Rover Sport is also available with a small, kid-friendly third-row seat, which takes its seating capacity from five to seven. Its front seats are firm and supportive, especially on long drives, and rear-seat air-conditioning vents and controls are standard. Heated rear seats are available. Build quality is superior, with soft surfaces and controls that look and feel expensive. Behind the Range Rover Sport's second row is a generous 28 cubic feet of cargo space. The Rover's reclining second row easily folds flat, expanding the space to 59 cubic feet of space, which is about average for the midsize luxury SUV class.\nContact: hoffmanbrett165@gmail.com to get your new ride",
        "price": "$83650"
    },
    {
        "title": "Financing for dump trucks - (We handle all credit types)",
        "city": "Wilmington, NC",
        "phone": "(561) 212-2193",
        "zip": "",
        "description": "Feel free to contact us to arrange financing for your next dump truck purchase. Our company has been a \"one stop\" shop for heavy duty truck and construction equipment financing for almost 30 years. Competitive commercial truck and equipment financing is available for all credit profiles.\n\n\n\n\n\n- Simple \"one page\" credit application\n\n- Good credits, bad credits, startups and everything in between\n\n- Optimum rates for better credits and longer time in business\n\n- Credit applications are processed for end users and vendors nationwide\n\n\n\n\n\nFeel free to apply with our company, even if other equipment financing sources could not help you. There is no cost or obligation to determine if you qualify - (561)-212-2193.",
        "price": "$0.00"
    },
    {
        "title": "Financing for dump trucks & equipment - (We handle all credit types & startups)",
        "city": "Eastern Shore, MD",
        "phone": "(561) 212-2193",
        "zip": "",
        "description": "Commercial truck and equipment financing is available for established businesses and startups. Our company has specialized in heavy duty truck and construction equipment financing for the last 29 years. We can handle all of your heavy equipment financing needs.\n\n\n\n\n\n- All credit types are welcome to apply, including startups\n\n- No cost to determine if you qualify\n\n- Optimum rates for better credits and longer time in business\n\n\n\n\n\nOur company does not sell commercial trucks or equipment; we arrange commercial equipment financing for end users and vendors nationwide. Feel free to contact us to learn more - (561)-212-2193.",
        "price": "$0.00"
    },
    {
        "title": "Attn: Dump truck operators - (Financing is available for all credit types)",
        "city": "Raleigh - Durham - Chapel Hill, NC",
        "phone": "(561) 212-2193",
        "zip": "",
        "description": "Our company does not sell commercial trucks or equipment; we arrange heavy duty truck and construction equipment financing for end users and vendors nationwide. Over the last 28 years, we have continued to expand our \"top of the line\" financing capabilities to be able to accommodate all types of credit requests, from A through D, including startups.\n\n\n\n\n\nIf you have located a truck or equipment for your business, feel to contact us to arrange financing, even if other equipment financing sources could not help you. There is no cost or obligation to determine if you qualify. The rates and terms will vary for each applicant based on their particular profile - (561)-212-2193.",
        "price": "$0.00"
    },
    {
        "title": "Dump truck & equipment funding - (We handle all credit types & startups)",
        "city": "Winston-Salem, NC",
        "phone": "(561) 212-2193",
        "zip": "",
        "description": "Our company has specialized in heavy duty truck and construction equipment financing for almost 30 years. We can help you finance a commercial truck or equipment that you need to generate income for your business. \n\n\n\n\n\n- All credit types are welcome to apply, including startups\n\n- No cost or obligation to determine if you qualify\n\n- Simple \"one page\" credit application\n\n- Optimum rates for better credits and longer time in business\n\n\n\n\n\nFeel free to contact us to discuss your commercial truck or equipment financing needs. Use our company as a resource. We are a \"one stop\" shop for commercial truck and equipment financing - (561)-212-2193.\n\n\n\n\n\n* Truck and equipment vendors are welcome to join our extensive network.",
        "price": "$0.00"
    },
    {
        "title": "Commercial truck & equipment financing - (We handle all credit types)",
        "city": "Houston, TX",
        "phone": "(561) 212-2193",
        "zip": "",
        "description": "If you have located a truck or equipment that you need for your business, feel free to contact us to arrange financing. Competitive commercial truck and equipment financing is available nationwide for all credit profiles.\n\n\n\n\nOur company is your best resource for heavy duty truck and construction equipment financing. Over the last 29 years, we have continued to expand our \"top of the line\" financing capabilities to be able to accommodate all types of credit requests, from A through D credit types, including startups.\n\n\n\n\n\n- Simple \"one page\" credit application\n\n- Excellent credits, damaged credits, startups and everything in between\n\n- Optimum rates for better credits and longer time in business\n\n- Credit applications are processed for end users and vendors large and small\n\n\n\n\n\nFeel free to apply with our company, even if other financing sources could not help you. There is no cost or obligation to determine if you qualify. If you contact us by email, include your phone number and the type of truck or equipment that you need to finance - (561)-212-2193.",
        "price": "$0.00"
    },
    {
        "title": "2003 Toyota Camry LE",
        "city": "Garden Grove",
        "phone": "714-222-5363",
        "zip": "92844",
        "description": "Price-$5,500.00\n\nYear-2003\n\nMake-Toyota \n\nModel-Camry LE \n\nColor-Silver\n\nVin. #-4T1BE32K23U683225\n\nEngine-V4 2.4L\n\nFuel -Gasoline\n\nMileage-137,939\n\nTransmission-Auto\n\nThis vehicle is in excellent condition. \n\nFinance is also available to a qualified customer and qualified car.\n\nCall Best Auto Sales at 714-222-5363\n\nor Visit us in Garden Grove, CA 92844\n\nAsk for Brandon Chun \n\nWe also purchase used cars. Any condition is OK. Will pay TOP dollars.",
        "price": "$5500"
    },
    {
        "title": "2013 Toyota Prius II",
        "city": "Garden Grove",
        "phone": "714-222-5363",
        "zip": "92844",
        "description": "Price-$12,500.00\n\nYear-2013\n\nMake-Toyota \n\nModel-Prius II\n\nColor-Gray\n\nVin. #-JTDKN3DU1D5620650\n\nEngine-V4 1.8L\n\nFuel- Hybrid\n\nMileage-109,456\n\nTransmission-Auto\n\nThis vehicle is in excellent condition. \n\nFinance is also available to a qualified customer and qualified car.\n\nCall Best Auto Sales at 714-222-5363\n\nor Visit us in Garden Grove, CA 92844\n\nAsk for Brandon Chun \n\nWe also purchase used cars. Any condition is OK. Will pay TOP dollars.",
        "price": "$12500"
    },
    {
        "title": "Commercial vehicle & equipment financing - (All credit types)",
        "city": "Cleveland, OH",
        "phone": "(561) 212-2193",
        "zip": "",
        "description": "Financing for commercial trucks and equipment is available nationwide for all credit types, including startups. Our company has been a \"one stop\" shop for heavy duty truck and construction equipment financing for almost 30 years. \n\n\n\n\n\nCredit applications are processed for end users and vendors large and small. The application process is simple and there is no cost or obligation to determine if you qualify. If you have located a truck or equipment that you need to finance for your business, feel free to contact us for additional information - (561)-212-2193.",
        "price": "$0.00"
    },
    {
        "title": "2010 Honda Odyssey EXL! Side Entry Wheelchair Accessible",
        "city": "Brooklyn",
        "phone": "9175207452",
        "zip": "11213",
        "description": "🌟 Introducing our 2010 Honda Odyssey EXL! Side Entry Wheelchair Accessible 🌟\n\n$19,995!\n\n• Only 24k Miles \n\n• Beige Leather Seats \n\n• Rearview Camera \n\n• Power Sliding Doors \n\n• Bluetooth Connectivity \n\n• Swivel Seat \n\n• Hand Controls\n\n• Tri-Zone Climate Control \n\n \n\nText or Call: 917-520-7452\n\nEmail: 773cars@gmail.com\n\nVisit our website: www.seewaldcars.com",
        "price": "$19,995"
    },
    {
        "title": "Dump truck & heavy equipment financing - (All credit types are welcome to apply)",
        "city": "Greensboro, NC",
        "phone": "(561) 212-2193",
        "zip": "",
        "description": "Commercial truck and equipment financing is available for all credit profiles. Credit applications are processed for end users and vendors nationwide. Our company has been a \"one stop\" shop for heavy duty truck and construction equipment financing for more than two decades.\n\n\n\n\n\n- Simple \"one page\" credit application\n\n- Optimum rates for better credits and longer time in business\n\n- All credit types are welcome to apply, including startups\n\n\n\n\n\nFeel free to contact us to discuss your commercial truck or equipment financing needs. There is no cost to determine if you qualify - (561)-212-2193.",
        "price": "$0.00"
    },
    {
        "title": "Financing for commercial trucks & equipment - (All credit types are welcome)",
        "city": "Charlotte, NC",
        "phone": "(561) 212-2193",
        "zip": "",
        "description": "Our company has specialized in heavy duty truck and construction equipment financing for almost 30 years. Our diverse underwriting capabilities allow us to arrange commercial truck and equipment funding for all credit types, including startups. If you have located a truck or equipment that you need for your business, feel free to contact us to arrange financing.\n\n\n\n\n- No cost or obligation to determine if you qualify\n\n- Simple \"one page\" credit application\n\n- Good credits, bad credits, startups and everything in between\n\n\n\n\n\nWe do not sell trucks or equipment; we arrange commercial truck and equipment financing for end users and vendors nationwide. Our company can handle all of your commercial truck and equipment financing needs. The equipment financing terms and conditions will vary for each applicant based on their particular profile - (561)-212-2193.\n\n\n\n\n\n* Truck and equipment vendors are welcome to join our extensive network.",
        "price": "$0.00"
    },
    {
        "title": "Dump truck financing - (We handle all credit types & startups)",
        "city": "Fayetteville, NC",
        "phone": "(561) 212-2193",
        "zip": "",
        "description": "If you have located a dump truck that you need to finance, feel free to contact our company to arrange financing, even if other commercial truck financing sources could not help you. Financing for heavy duty trucks and construction equipment is available nationwide for good credits, bad credits, startups and everything in between.\n\n\n\n\n\nThe application process is simple and there is no cost to determine if you qualify. Our company has specialized in commercial truck and equipment financing for the last 28 years. We will provide the best commercial equipment financing terms and conditions available for your particular profile. Feel free to contact us to learn more - (561)-212-2193.",
        "price": "$0.00"
    },
    {
        "title": "Financing for dump trucks - (We handle all credit types & startups)",
        "city": "Roanoke, VA",
        "phone": "(561) 212-2193",
        "zip": "",
        "description": "Commercial truck and equipment financing funding is available nationwide for excellent credits, damaged credits, startups and everything in between. If you need to finance a dump truck, you should contact us, even if other financing sources could not help you.\n\n\n\n\n\nUse our company as a resource. We have been a \"one stop\" shop for heavy duty truck and construction equipment financing for the last 28 years. There is no cost or obligation to determine if you qualify. Feel free to contact us for your next commercial truck loan. The equipment financing terms and conditions will vary for each applicant based on their particular profile - (561)-212-2193.",
        "price": "$0.00"
    },
    {
        "title": "2014 Toyota Prius II",
        "city": "Garden Grove",
        "phone": "714-222-5363",
        "zip": "92844",
        "description": "Price-$10,999.00\n\nYear-2014\n\nMake-Toyota \n\nModel-Prius II\n\nColor-Gray\n\nVin. #-JTDKN3DU1E1755314\n\nEngine-V4 1.8L\n\nFuel -Hybrid\n\nMileage-149,806\n\nTransmission-Auto\n\nThis vehicle is in excellent condition. \n\nFinance is also available to a qualified customer and qualified car.\n\nCall Best Auto Sales at 714-222-5363\n\nor Visit us in Garden Grove, CA 92844\n\nAsk for Brandon Chun \n\nWe also purchase used cars. Any condition is OK. Will pay TOP dollars.",
        "price": "$10999"
    }
]